%第二问
bar([1.5:4:21.5],CMn,'BarWidth',0.2,'FaceColor','b');
hold on;
bar([2.5:4:22.5],CNH3,'BarWidth',0.2,'FaceColor','c');
legend('CODMn','NH3-N');
labelID = ['第一段';'第二段'; '第三段'; '第四段'; '第五段';'第六段'];
set(gca,'XTick',2:4:22)
set(gca,'XTickLabel',labelID);
title('各段流域CODMn和NH3-N的污染的含量');
text(0,0,'123')

%第一问
bar([1:17],zonghepingjia,'BarWidth',0.5,'FaceColor','c');
legend('评价指标');
labelID = ['01';'02';'03';'04';'05';'06';'07';'08';'09';'10';'11';'12';'13';'14';'15';'16';'17'];
set(gca,'XTick',1:17)
set(gca,'XTickLabel',labelID);
title('各地区综合评价指标');
text(0,0,'地区')
text(0,0,'综合评价指标')

%第三问
yplot=[93.1	85.6996	83.7427	81.8306	79.9621	78.1363	76.3521	74.6088	72.9052	71.2405	69.6138	68.0243	66.471	64.9533	63.4701	62.0209	60.6047	59.2209	57.8687	56.5473;
3.9	10.9144	11.0328	11.1525	11.2735	11.3957	11.5193	11.6443	11.7706	11.8983	12.0273	12.1578	12.2896	12.4229	12.5577	12.6939	12.8316	12.9708	13.1114	13.2537;
3	2.65901	2.95006	3.27298	3.63124	4.02871	4.46969	4.95894	5.50175	6.10397	6.7721	7.51338	8.33579	9.24822	10.2605	11.3836	12.6297	14.0121	15.5459	17.2476;
0	0.72699	2.27444	3.74392	5.13316	6.43929	7.65891	8.78796	9.82245	10.75723	11.5868	12.30452	12.90361	13.37558	13.7117	13.9016	13.934	13.7962	13.474	12.9514]
subplot(2,2,1);
hold on;
title('饮用水变化趋势');
plot([1:19],yplot(1,2:end),'b');
plot([1:19],yplot(1,2:end),'b.');
plot([1:10],percent(:,1),'b*');
legend('预测值','实际值')
subplot(2,2,2);
hold on;
title('IV类水变化趋势');
plot([1:19],yplot(2,2:end),'g');
plot([1:19],yplot(2,2:end),'g.');
plot([1:10],percent(:,2)','g*');
subplot(2,2,3);
hold on;
title('V类水变化趋势');
plot([1:19],yplot(3,2:end),'r');
plot([1:19],yplot(3,2:end),'r.');
plot([1:10],percent(:,3)','r*');
%'ro','MarkerFaceColor','g'
subplot(2,2,4);
hold on;
title('劣V类水变化趋势');
plot([1:19],yplot(4,2:end),'c');
plot([1:19],yplot(4,2:end),'c.');
plot([1:10],percent(:,4)','c*');

plot([1:20],yplot,'square');
plot([1:10],percent','*')

